# Script de creación de la Base de Datos, las Tablas y sus Inserciones.

Práctica 06 B - JOINING DATA

In [4]:
DROP DATABASE joiningdata6b;
-- Crear la base de datos
CREATE DATABASE IF NOT EXISTS joiningdata6b;

-- Usar la base de datos creada
USE joiningdata6b;

-- Crear la tabla tabla_artista
CREATE TABLE IF NOT EXISTS tabla_artista (
    id_artista INT PRIMARY KEY,
    nombre VARCHAR(255)
);

-- Insertar datos en la tabla tabla_artista
INSERT INTO tabla_artista (id_artista, nombre) VALUES
(1, 'AC/DC'),
(2, 'Aerosmith'),
(3, 'Alanis Morissette');

-- Crear la tabla tabla_album
CREATE TABLE IF NOT EXISTS tabla_album (
    id_album INT PRIMARY KEY,
    titulo VARCHAR(255),
    id_artista INT
);

-- Insertar datos en la tabla tabla_album
INSERT INTO tabla_album (id_album, titulo, id_artista) VALUES
(1, 'For those who rock', 1),
(2, 'Dream on', 2),
(3, 'Restless and wild', 2),
(4, 'Let there be rock', 1),
(5, 'Rumours', 6);